; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        ; (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=7, packages=16, locations=16, max_capacity=3, out_folder=training/easy, instance_id=90, seed=131

(define (problem transport-90)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c3)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c2)
    (capacity v7 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l13)
    (at p2 l4)
    (at p3 l12)
    (at p4 l4)
    (at p5 l6)
    (at p6 l8)
    (at p7 l15)
    (at p8 l16)
    (at p9 l7)
    (at p10 l8)
    (at p11 l2)
    (at p12 l6)
    (at p13 l15)
    (at p14 l7)
    (at p15 l14)
    (at p16 l3)
    (at v1 l1)
    (at v2 l16)
    (at v3 l9)
    (at v4 l14)
    (at v5 l3)
    (at v6 l5)
    (at v7 l3)
    (road l12 l1)
    (road l12 l7)
    (road l6 l15)
    (road l4 l9)
    (road l3 l10)
    (road l11 l2)
    (road l10 l3)
    (road l2 l11)
    (road l1 l12)
    (road l14 l3)
    (road l5 l3)
    (road l14 l12)
    (road l9 l4)
    (road l9 l16)
    (road l8 l14)
    (road l16 l9)
    (road l15 l7)
    (road l13 l10)
    (road l7 l12)
    (road l7 l15)
    (road l12 l11)
    (road l4 l1)
    (road l3 l5)
    (road l12 l14)
    (road l14 l8)
    (road l3 l14)
    (road l1 l4)
    (road l10 l13)
    (road l11 l12)
    (road l15 l6)
    (road l4 l11)
    (road l11 l4)
    (road l13 l14)
    (road l14 l13)
    (road l7 l8)
    (road l8 l7)
    (road l3 l15)
    (road l15 l3)
    (road l11 l14)
    (road l14 l11)
    (road l2 l16)
    (road l16 l2)
    (road l2 l12)
    (road l12 l2)
    (road l7 l13)
    (road l13 l7)
    (road l1 l6)
    (road l6 l1)
    )
 (:goal  (and 
    (at p1 l4)
    (at p2 l7)
    (at p3 l4)
    (at p4 l1)
    (at p5 l5)
    (at p6 l13)
    (at p7 l14)
    (at p8 l6)
    (at p9 l11)
    (at p10 l3)
    (at p11 l15)
    (at p12 l14)
    (at p13 l8)
    (at p14 l10)
    (at p15 l13)
    (at p16 l14))))

; plan
1. (drive v1 l1 l12)
   deleted: (at v1 l1)
   added: (at v1 l12)
   goals met: 0 of 16
2. (drive v1 l12 l7)
   deleted: (at v1 l12)
   added: (at v1 l7)
   goals met: 0 of 16
3. (drive v1 l7 l13)
   deleted: (at v1 l7)
   added: (at v1 l13)
   goals met: 0 of 16
4. (pick-up v1 l13 p1 c1 c2)
   deleted: (at p1 l13) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 16
5. (drive v1 l13 l14)
   deleted: (at v1 l13)
   added: (at v1 l14)
   goals met: 0 of 16
6. (drive v1 l14 l11)
   deleted: (at v1 l14)
   added: (at v1 l11)
   goals met: 0 of 16
7. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 0 of 16
8. (drop v1 l4 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l4) (capacity v1 c2)
   goals met: 1 of 16
9. (pick-up v1 l4 p2 c1 c2)
   deleted: (at p2 l4) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 16
10. (drive v1 l4 l1)
   deleted: (at v1 l4)
   added: (at v1 l1)
   goals met: 1 of 16
11. (drive v1 l1 l12)
   deleted: (at v1 l1)
   added: (at v1 l12)
   goals met: 1 of 16
12. (drive v1 l12 l7)
   deleted: (at v1 l12)
   added: (at v1 l7)
   goals met: 1 of 16
13. (drop v1 l7 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l7) (capacity v1 c2)
   goals met: 2 of 16
14. (drive v1 l7 l12)
   deleted: (at v1 l7)
   added: (at v1 l12)
   goals met: 2 of 16
15. (pick-up v1 l12 p3 c1 c2)
   deleted: (at p3 l12) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 16
16. (drive v1 l12 l1)
   deleted: (at v1 l12)
   added: (at v1 l1)
   goals met: 2 of 16
17. (drive v1 l1 l4)
   deleted: (at v1 l1)
   added: (at v1 l4)
   goals met: 2 of 16
18. (drop v1 l4 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l4) (capacity v1 c2)
   goals met: 3 of 16
19. (pick-up v1 l4 p4 c1 c2)
   deleted: (at p4 l4) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 16
20. (drive v1 l4 l1)
   deleted: (at v1 l4)
   added: (at v1 l1)
   goals met: 3 of 16
21. (drop v1 l1 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l1) (capacity v1 c2)
   goals met: 4 of 16
22. (drive v1 l1 l6)
   deleted: (at v1 l1)
   added: (at v1 l6)
   goals met: 4 of 16
23. (pick-up v1 l6 p5 c1 c2)
   deleted: (at p5 l6) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 16
24. (drive v1 l6 l15)
   deleted: (at v1 l6)
   added: (at v1 l15)
   goals met: 4 of 16
25. (drive v1 l15 l3)
   deleted: (at v1 l15)
   added: (at v1 l3)
   goals met: 4 of 16
26. (drive v1 l3 l5)
   deleted: (at v1 l3)
   added: (at v1 l5)
   goals met: 4 of 16
27. (drop v1 l5 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l5) (capacity v1 c2)
   goals met: 5 of 16
28. (drive v1 l5 l3)
   deleted: (at v1 l5)
   added: (at v1 l3)
   goals met: 5 of 16
29. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 5 of 16
30. (drive v1 l14 l8)
   deleted: (at v1 l14)
   added: (at v1 l8)
   goals met: 5 of 16
31. (pick-up v1 l8 p6 c1 c2)
   deleted: (at p6 l8) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 16
32. (drive v1 l8 l14)
   deleted: (at v1 l8)
   added: (at v1 l14)
   goals met: 5 of 16
33. (drive v1 l14 l13)
   deleted: (at v1 l14)
   added: (at v1 l13)
   goals met: 5 of 16
34. (drop v1 l13 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l13) (capacity v1 c2)
   goals met: 6 of 16
35. (drive v1 l13 l7)
   deleted: (at v1 l13)
   added: (at v1 l7)
   goals met: 6 of 16
36. (drive v1 l7 l15)
   deleted: (at v1 l7)
   added: (at v1 l15)
   goals met: 6 of 16
37. (pick-up v1 l15 p7 c1 c2)
   deleted: (at p7 l15) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 6 of 16
38. (drive v1 l15 l3)
   deleted: (at v1 l15)
   added: (at v1 l3)
   goals met: 6 of 16
39. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 6 of 16
40. (drop v1 l14 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l14) (capacity v1 c2)
   goals met: 7 of 16
41. (drive v1 l14 l12)
   deleted: (at v1 l14)
   added: (at v1 l12)
   goals met: 7 of 16
42. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 7 of 16
43. (drive v1 l2 l16)
   deleted: (at v1 l2)
   added: (at v1 l16)
   goals met: 7 of 16
44. (pick-up v1 l16 p8 c1 c2)
   deleted: (at p8 l16) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 7 of 16
45. (drive v1 l16 l9)
   deleted: (at v1 l16)
   added: (at v1 l9)
   goals met: 7 of 16
46. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 7 of 16
47. (drive v1 l4 l1)
   deleted: (at v1 l4)
   added: (at v1 l1)
   goals met: 7 of 16
48. (drive v1 l1 l6)
   deleted: (at v1 l1)
   added: (at v1 l6)
   goals met: 7 of 16
49. (drop v1 l6 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l6) (capacity v1 c2)
   goals met: 8 of 16
50. (drive v1 l6 l15)
   deleted: (at v1 l6)
   added: (at v1 l15)
   goals met: 8 of 16
51. (drive v1 l15 l7)
   deleted: (at v1 l15)
   added: (at v1 l7)
   goals met: 8 of 16
52. (pick-up v1 l7 p9 c1 c2)
   deleted: (at p9 l7) (capacity v1 c2)
   added: (in p9 v1) (capacity v1 c1)
   goals met: 8 of 16
53. (drive v1 l7 l12)
   deleted: (at v1 l7)
   added: (at v1 l12)
   goals met: 8 of 16
54. (drive v1 l12 l11)
   deleted: (at v1 l12)
   added: (at v1 l11)
   goals met: 8 of 16
55. (drop v1 l11 p9 c1 c2)
   deleted: (in p9 v1) (capacity v1 c1)
   added: (at p9 l11) (capacity v1 c2)
   goals met: 9 of 16
56. (drive v1 l11 l14)
   deleted: (at v1 l11)
   added: (at v1 l14)
   goals met: 9 of 16
57. (drive v1 l14 l8)
   deleted: (at v1 l14)
   added: (at v1 l8)
   goals met: 9 of 16
58. (pick-up v1 l8 p10 c1 c2)
   deleted: (at p10 l8) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 9 of 16
59. (drive v1 l8 l14)
   deleted: (at v1 l8)
   added: (at v1 l14)
   goals met: 9 of 16
60. (drive v1 l14 l3)
   deleted: (at v1 l14)
   added: (at v1 l3)
   goals met: 9 of 16
61. (drop v1 l3 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l3) (capacity v1 c2)
   goals met: 10 of 16
62. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 10 of 16
63. (drive v1 l14 l12)
   deleted: (at v1 l14)
   added: (at v1 l12)
   goals met: 10 of 16
64. (drive v1 l12 l2)
   deleted: (at v1 l12)
   added: (at v1 l2)
   goals met: 10 of 16
65. (pick-up v1 l2 p11 c1 c2)
   deleted: (at p11 l2) (capacity v1 c2)
   added: (in p11 v1) (capacity v1 c1)
   goals met: 10 of 16
66. (drive v1 l2 l12)
   deleted: (at v1 l2)
   added: (at v1 l12)
   goals met: 10 of 16
67. (drive v1 l12 l7)
   deleted: (at v1 l12)
   added: (at v1 l7)
   goals met: 10 of 16
68. (drive v1 l7 l15)
   deleted: (at v1 l7)
   added: (at v1 l15)
   goals met: 10 of 16
69. (drop v1 l15 p11 c1 c2)
   deleted: (in p11 v1) (capacity v1 c1)
   added: (at p11 l15) (capacity v1 c2)
   goals met: 11 of 16
70. (drive v1 l15 l6)
   deleted: (at v1 l15)
   added: (at v1 l6)
   goals met: 11 of 16
71. (pick-up v1 l6 p12 c1 c2)
   deleted: (at p12 l6) (capacity v1 c2)
   added: (in p12 v1) (capacity v1 c1)
   goals met: 11 of 16
72. (drive v1 l6 l15)
   deleted: (at v1 l6)
   added: (at v1 l15)
   goals met: 11 of 16
73. (drive v1 l15 l3)
   deleted: (at v1 l15)
   added: (at v1 l3)
   goals met: 11 of 16
74. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 11 of 16
75. (drop v1 l14 p12 c1 c2)
   deleted: (in p12 v1) (capacity v1 c1)
   added: (at p12 l14) (capacity v1 c2)
   goals met: 12 of 16
76. (drive v1 l14 l3)
   deleted: (at v1 l14)
   added: (at v1 l3)
   goals met: 12 of 16
77. (drive v1 l3 l15)
   deleted: (at v1 l3)
   added: (at v1 l15)
   goals met: 12 of 16
78. (pick-up v1 l15 p13 c1 c2)
   deleted: (at p13 l15) (capacity v1 c2)
   added: (in p13 v1) (capacity v1 c1)
   goals met: 12 of 16
79. (drive v1 l15 l7)
   deleted: (at v1 l15)
   added: (at v1 l7)
   goals met: 12 of 16
80. (drive v1 l7 l8)
   deleted: (at v1 l7)
   added: (at v1 l8)
   goals met: 12 of 16
81. (drop v1 l8 p13 c1 c2)
   deleted: (in p13 v1) (capacity v1 c1)
   added: (at p13 l8) (capacity v1 c2)
   goals met: 13 of 16
82. (drive v1 l8 l7)
   deleted: (at v1 l8)
   added: (at v1 l7)
   goals met: 13 of 16
83. (pick-up v1 l7 p14 c1 c2)
   deleted: (at p14 l7) (capacity v1 c2)
   added: (in p14 v1) (capacity v1 c1)
   goals met: 13 of 16
84. (drive v1 l7 l13)
   deleted: (at v1 l7)
   added: (at v1 l13)
   goals met: 13 of 16
85. (drive v1 l13 l10)
   deleted: (at v1 l13)
   added: (at v1 l10)
   goals met: 13 of 16
86. (drop v1 l10 p14 c1 c2)
   deleted: (in p14 v1) (capacity v1 c1)
   added: (at p14 l10) (capacity v1 c2)
   goals met: 14 of 16
87. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 14 of 16
88. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 14 of 16
89. (pick-up v1 l14 p15 c1 c2)
   deleted: (at p15 l14) (capacity v1 c2)
   added: (in p15 v1) (capacity v1 c1)
   goals met: 14 of 16
90. (drive v1 l14 l13)
   deleted: (at v1 l14)
   added: (at v1 l13)
   goals met: 14 of 16
91. (drop v1 l13 p15 c1 c2)
   deleted: (in p15 v1) (capacity v1 c1)
   added: (at p15 l13) (capacity v1 c2)
   goals met: 15 of 16
92. (drive v1 l13 l10)
   deleted: (at v1 l13)
   added: (at v1 l10)
   goals met: 15 of 16
93. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 15 of 16
94. (pick-up v1 l3 p16 c1 c2)
   deleted: (at p16 l3) (capacity v1 c2)
   added: (in p16 v1) (capacity v1 c1)
   goals met: 15 of 16
95. (drive v1 l3 l14)
   deleted: (at v1 l3)
   added: (at v1 l14)
   goals met: 15 of 16
96. (drop v1 l14 p16 c1 c2)
   deleted: (in p16 v1) (capacity v1 c1)
   added: (at p16 l14) (capacity v1 c2)
   goals met: 16 of 16
